Revit 2027 API
ParameterTypeId.RoomConstructionSetParam Property
 "Construction Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomConstructionSetParam { get; }
Public Shared ReadOnly Property RoomConstructionSetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomConstructionSetParam {
	ForgeTypeId^ get ();
}
static member RoomConstructionSetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace